# VS Code extensions, installed by scripts/vscode-extensions-install.sh.
# Full-line and inline # comments are ignored — comment an item out to skip it.

# AI assistants
anthropic.claude-code
openai.chatgpt
ms-vscode.vscode-chat-customizations-evaluations

# Python
donjayamanne.python-environment-manager
ms-python.debugpy
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs

# Jupyter
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# Data / SQL
dbtlabsinc.dbt           # dbt language support
mechatroner.rainbow-csv  # colorize CSV columns

# Azure / DevOps
ms-azure-devops.azure-pipelines
ms-azuretools.vscode-bicep
ms-azuretools.vscode-containers
ms-dotnettools.vscode-dotnet-runtime  # runtime dependency for the Azure extensions

# Markdown / docs
davidanson.vscode-markdownlint
yzhang.markdown-all-in-one
vstirbu.vscode-mermaid-preview
tomoki1207.pdf           # PDF preview

# Diagrams
hediet.vscode-drawio
jmkrivocapich.drawfolderstructure

# Remote development
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer

# Misc
ms-vscode.live-server
tamasfe.even-better-toml
